c16/retro/esp32-c3-demo-idf/synesthesia/sdkconfig.defaults
# ESP32-C3 Configuration for Synesthesia
CONFIG_IDF_TARGET="esp32c3"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Performance optimizations
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# Arduino component
CONFIG_ENABLE_ARDUINO_DEPENDS=y

# Disable unnecessary features
CONFIG_BT_ENABLED=n
CONFIG_LWIP_IPV6=n

# Optimization for performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Larger stack for audio/visual processing
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# Enable hardware timer
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096

# Serial monitor
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
